[
  {
    "name": "Rental unit in Calgary · ★4.82 · 2 bedrooms · 3 beds · 1 bath",
    "price": 153.08,
    "description": "Welcome to our 2-bed home in the heart of the Beltline! The dining area comfortably seats 6, perfect for gatherings. The primary bedroom features a super comfy King bed, while the secondary offers a cozy Queen. Need more space? A queen pull-out couch adds flexibility.Enjoy in-suite laundry and a fully stocked kitchen. Building amenities include a Gym and a Rooftop Patio with downtown views. Just 3 blocks off 17th Ave, this unit offers unbeatable walkability to shops, dining, and entertainment!The spaceDiscover ultimate comfort and style in this beautifully designed 2-bedroom condo, offering everything you need for a relaxing stay:Bright & Open:-Sunlit south-facing balcony to enjoy natural light-Spacious dining table for 6, plus extra seating at the kitchen islandWork-Friendly:-Dedicated workspace with high-speed internet, printer, monitor, keyboard, and mouseCozy Bedrooms:-Primary room with a SUPER COMFY king-sized bed and generous closet space-Secondary room with a comfortable queen bed-Queen-sized pull-out couch for additional guestsWell-Equipped Bathroom:-Soft face, hand, and bath towels-Stocked with shampoo, conditioner, and body washFully Loaded Kitchen:-Features a blender, coffee maker, toaster, hot water kettle, and baking tools-Keurig machine with complimentary coffee pods for your morningsAdded Convenience:-58\" Smart TV-In Unit laundry room Building Amenities:-On-site fitness room-Stunning rooftop patio with panoramic city viewsUnbeatable Location:-Steps from Calgary’s best restaurants, shops, and downtown attractions-Ideal for those seeking a vibrant, walkable lifestyleWith its modern design, thoughtful amenities, and prime location, this condo is the perfect place to call home during your stay!Guest accessYou will have access to the entire Condo during your stay.Other things to note-Missing keys incur a $250 replacement fee.-Respect condo bylaws, especially quiet hours after 10pm. We use a noise monitoring device; It does NOT record actual sounds or conversations, it simply monitors the noise level (measured in decibels). Minut is 100% privacy compliant and is required on this property. If you have any questions, please ask! :)Registration detailsBL287930",
    "category": "Stays",
    "availability": "true",
    "reviews": [
      "Nice place in a great area. Parking was excellent as spot is 20 steps from your door. Beds were quite comfortable and kitchen was stocked with everything you need. The area is pretty noisy at night but being downtown it should be expected. We really enjoyed our stay and would definitely stay again. Thank you Tristan",
      "The location was perfect for our stay. We attended a festival at Cowboy Park which was approximately a 15 min walk from this place. There is a lot of places to eat close by and within walking distance. The parking spot and street parking are both convenient and felt safe. The instructions into the building were a little confusing but we managed. Overall, we would definitely stay again and would recommend the space.",
      "Tristan’s place is fantastic! Great furnishings and comfortable beds. The location is close to wonderful restaurants and coffeehouses. It is close to lots of things to do yet tucked in a quiet street. The parking stall was very appreciated. Thanks Tristan!",
      "Great value for money, the apartment was beautiful and had everything you need. Tristan was very responsive and helpful, I’d definitely stay again if I came back to Calgary",
      "Our stay was wonderful, it’s a nice fancy safe place by the heart of downtown, only 5 minutes from Calgary tower and 5 to 6 minutes away from two downtown mosques in Calgary.",
      "We had a wonderful stay at Tristan’s place in Calgary! The house was clean, secure, and beautifully maintained. It looked just like the photos, if not better. Tristan was an excellent host, very welcoming and quick to respond to our messages. We truly felt comfortable and well taken care of throughout our stay.<br/>Will definitely recommend this place to all our friends and family in Saskatoon!",
      "Pros:Great location! Beds were comfy. very little required from us to check out which was appreciated. <br/>Con:Pictures did not meet the actual place (small apartment) The work space is in the living room right next to the only TV, Sofa and access to the balcony. So if one of you is working the other person will have to be in one of the bedrooms.",
      "Very good spot, very centric.  It has been a good experience. The flat is comfortable and nice. Recommendable.<br/>Unfortunately, there was a fire alarm inspection during our stay. We couldn’t access to the rooftop.<br/>The price is a bit high comparing to other places, but it is true that is in Calgary Downtown and during the summer.",
      "This place was amazing and the hosts had the two most important qualities I like to see: responsive and friendly. From the property you can get anywhere downtown in about 10 mins driving and there are a ton of things within a 5 to 10 min walk. It is in a safe neighborhood and while we were there it was quiet and peaceful. If you are looking for an affordable clean place to stay with responsive hosts then I recomend!",
      "Host was very communicative and responsive. Location is awesome and the place was accurately represented in the photos. <br/>**IMPORTANT** This building is VERY strict on noise. We were threatened by a resident at 3 pm in the afternoon because we were playing music and we talked in halls. We felt like we were walking on eggshells for the remainder of our stay. This place is suitable as a landing spot for a quiet group, but I would not recommend if you’re looking for a place that feels like home.",
      "Had some issues with the check in process due to a miscommunication on the host's part, but apart from that rough start, it was overall a great place (clean, quiet, good location).",
      "Really loved the location!  Very convenient to 17th Avenue with tons of restaurant options and shopping.  In the other direction, it was a short walk to the Central Library and the incredible murals all over Calgary!",
      "Tristan was friendly and communicative our whole stay - always reaching out to make sure everything was going okay. :) Great host!",
      "Great stay, proactive and responsive hosts, everything is exactly same as listed, thanks for hosting us.",
      "I found Tristan’s place an absolute diamond of a find! It was so secure and private, in a great location walkable to the bustling streets for restaurants and shops. The apartment was pristine and beautifully furnished, the kitchen was kitted out and very well stocked. The owners were so helpful and kind also. Such good value for money and will definitely stay again when I’m back in Calgary. Couldn’t recommend more highly! :)",
      "Second time staying here. Great location and awesome host. Highly recommended and definitely stay here next time!",
      "The lodging matched the photos and description. We liked the apartment and the location. The price was very reasonable. We had 5 ppl stay comfortably. My reasons for not giving 5 stars is the fairly unreasonable quiet hours and the manner we were treated by other residents. And the serious amount of door locks and security was at times frustrating. It was hard to get in and out with all the keys fobs locks buttons and doors. If you intend to have a very quiet stay and few occupants this prob would be a great choice. If you wanna hang here and enjoy a few laughs in the middle of the day be prepared for noise disturbance complaints both from residents and an in house monitor system. The host was great and very good communicator. I just would not bring a group here. Beds were ok, but not great. Bathroom and kitchen very nice. Great location in Calgary. Cute place.  I’m sad we never went to the rooftop. We used the parking garage spot which was very convenient.",
      "Great place to stay in downtown Calgary. Great neighbourhood, close to shops. Highly recommended.",
      "Great experience! Highly recommend. Beautiful apartment and host was extremely helpful. Wish we stayed longer!",
      "We booked  staff members in Tristan’s place and they had a wonderful experience.  Very happy with their accommodations and how well Tristan communicated.",
      "Excellent place to stay in Calgary. Very peaceful area, yet walkable to a ton of places in the area. The apartment was exactly as described, and the parking was great for a Full size F150 truck. The unit matched the pictures and descriptions, and the hosts were excellent.",
      "nice quiet location. Walking distance to everything I needed - safeway is just around the corner.<br/>I stayed 2 weeks and it was homey.<br/>I loved it so much I am coming back for work for 3 week and booked it again.<br/>Kenzie was a gem to deal with.",
      "Clean , convenient and good fare pricing",
      "Very clean and well located place to stay in Calgary."
    ],
    "ratings": 4.82,
    "location": "Calgary, Alberta, Canada",
    "lat": 51.0403,
    "long": -114.0802,
    "guests": 6,
    "pets_allowed": true,
    "description_items": [
      "Entire rental unit",
      "3 beds",
      "1 bath"
    ],
    "category_rating": [
      {
        "name": "Cleanliness",
        "value": "4.9"
      },
      {
        "name": "Accuracy",
        "value": "4.9"
      },
      {
        "name": "Check-in",
        "value": "4.7"
      },
      {
        "name": "Communication",
        "value": "5.0"
      },
      {
        "name": "Location",
        "value": "4.9"
      },
      {
        "name": "Value",
        "value": "4.7"
      }
    ],
    "house_rules": [
      "Check-in: 3:00 p.m.–9:00 p.m.",
      "Checkout before 11:00 a.m.",
      "6 guests maximum"
    ],
    "details": [
      "6 guests",
      "2 bedrooms",
      "3 beds",
      "1 bath"
    ],
    "highlights": [
      {
        "name": "Self check-in",
        "value": "Check yourself in with the smartlock."
      },
      {
        "name": "Comfy bed for better sleep",
        "value": "The room-darkening shades and extra bedding are loved by guests."
      },
      {
        "name": "Great restaurants nearby",
        "value": "Guests say there are excellent options for dining out."
      }
    ],
    "arrangement_details": [
      {
        "name": "Bedroom 1",
        "value": "1 king bed"
      },
      {
        "name": "Bedroom 2",
        "value": "1 queen bed"
      },
      {
        "name": "Living room",
        "value": "1 sofa bed"
      }
    ],
    "amenities": [
      {
        "items": [
          {
            "value": "SYSTEM_BATHTUB",
            "name": "Bathtub"
          },
          {
            "value": "SYSTEM_HAIRDRYER",
            "name": "Hair dryer"
          },
          {
            "value": "SYSTEM_CLEANING_SUPPLIES",
            "name": "Cleaning products"
          },
          {
            "value": "SYSTEM_SHAMPOO",
            "name": "Shampoo"
          },
          {
            "value": "SYSTEM_SHAMPOO",
            "name": "Conditioner"
          },
          {
            "value": "SYSTEM_SOAP",
            "name": "Body soap"
          },
          {
            "value": "SYSTEM_HOT_WATER",
            "name": "Hot water"
          },
          {
            "value": "SYSTEM_SOAP",
            "name": "Shower gel"
          }
        ],
        "group_name": "Bathroom"
      },
      {
        "items": [
          {
            "value": "SYSTEM_WASHER",
            "name": "Washer"
          },
          {
            "value": "SYSTEM_DRYER",
            "name": "Dryer"
          },
          {
            "value": "Towels, bed sheets, soap, and toilet paper",
            "name": "Essentials"
          },
          {
            "value": "SYSTEM_HANGERS",
            "name": "Hangers"
          },
          {
            "value": "SYSTEM_BLANKETS",
            "name": "Bed linens"
          },
          {
            "value": "SYSTEM_PILLOW",
            "name": "Extra pillows and blankets"
          },
          {
            "value": "SYSTEM_BLACKOUT_SHADES",
            "name": "Room-darkening shades"
          },
          {
            "value": "SYSTEM_IRON",
            "name": "Iron"
          },
          {
            "value": "SYSTEM_WARDROBE",
            "name": "Clothing storage"
          }
        ],
        "group_name": "Bedroom and laundry"
      },
      {
        "items": [
          {
            "value": "SYSTEM_CABLE",
            "name": "Ethernet connection"
          },
          {
            "value": "SYSTEM_TV",
            "name": "TV"
          }
        ],
        "group_name": "Entertainment"
      },
      {
        "items": [
          {
            "value": "SYSTEM_CHILD_UTENSILS",
            "name": "Children’s dinnerware"
          }
        ],
        "group_name": "Family"
      },
      {
        "items": [
          {
            "value": "SYSTEM_THERMOMETER",
            "name": "Heating"
          }
        ],
        "group_name": "Heating and cooling"
      },
      {
        "items": [
          {
            "value": "The monitor is not located in bedrooms, bathrooms, or sleeping areas.",
            "name": "Noise decibel monitors on property"
          },
          {
            "value": "Security camera built into the smart lock at the main door of the condo, facing outside.",
            "name": "Exterior security cameras on property"
          },
          {
            "value": "SYSTEM_DETECTOR_SMOKE",
            "name": "Smoke alarm"
          },
          {
            "value": "SYSTEM_DETECTOR_CO",
            "name": "Carbon monoxide alarm"
          },
          {
            "value": "SYSTEM_FIRE_EXTINGUISHER",
            "name": "Fire extinguisher"
          },
          {
            "value": "SYSTEM_FIRST_AID_KIT",
            "name": "First aid kit"
          }
        ],
        "group_name": "Home safety"
      },
      {
        "items": [
          {
            "value": "SYSTEM_WI_FI",
            "name": "Wifi"
          },
          {
            "value": "SYSTEM_WORKSPACE",
            "name": "Dedicated workspace"
          }
        ],
        "group_name": "Internet and office"
      },
      {
        "items": [
          {
            "value": "Space where guests can cook their own meals",
            "name": "Kitchen"
          },
          {
            "value": "SYSTEM_REFRIGERATOR",
            "name": "Refrigerator"
          },
          {
            "value": "SYSTEM_MICROWAVE",
            "name": "Microwave"
          },
          {
            "value": "Pots and pans, oil, salt and pepper",
            "name": "Cooking basics"
          },
          {
            "value": "Bowls, chopsticks, plates, cups, etc.",
            "name": "Dishes and silverware"
          },
          {
            "value": "SYSTEM_MINI_BAR",
            "name": "Mini fridge"
          },
          {
            "value": "SYSTEM_REFRIGERATOR",
            "name": "Freezer"
          },
          {
            "value": "SYSTEM_DISHWASHER",
            "name": "Dishwasher"
          },
          {
            "value": "SYSTEM_STOVE",
            "name": "Stove"
          },
          {
            "value": "SYSTEM_OVEN",
            "name": "Oven"
          },
          {
            "value": "SYSTEM_WATER_KETTLE",
            "name": "Hot water kettle"
          },
          {
            "value": "SYSTEM_COFFEE_MAKER",
            "name": "Coffee maker: Keurig coffee machine"
          },
          {
            "value": "SYSTEM_MAPS_BAR",
            "name": "Wine glasses"
          },
          {
            "value": "SYSTEM_TOASTER",
            "name": "Toaster"
          },
          {
            "value": "SYSTEM_BAKING_SHEET",
            "name": "Baking sheet"
          },
          {
            "value": "SYSTEM_BLENDER",
            "name": "Blender"
          },
          {
            "value": "SYSTEM_DINING_TABLE",
            "name": "Dining table"
          },
          {
            "value": "SYSTEM_COFFEE_MAKER",
            "name": "Coffee"
          }
        ],
        "group_name": "Kitchen and dining"
      },
      {
        "items": [
          {
            "value": "SYSTEM_LAUNDRY_SERVICE",
            "name": "Laundromat nearby"
          }
        ],
        "group_name": "Location features"
      },
      {
        "items": [
          {
            "value": "SYSTEM_PATIO_BALCONY",
            "name": "Patio or balcony"
          },
          {
            "value": "SYSTEM_ROOFTOP_DECK",
            "name": "Outdoor furniture"
          }
        ],
        "group_name": "Outdoor"
      },
      {
        "items": [
          {
            "value": "SYSTEM_MAPS_CAR_RENTAL",
            "name": "Free parking on premises"
          },
          {
            "value": "The home or building has an elevator that’s at least 52 inches deep and a doorway at least 32 inches wide",
            "name": "Elevator"
          },
          {
            "value": "SYSTEM_GYM",
            "name": "Gym"
          }
        ],
        "group_name": "Parking and facilities"
      },
      {
        "items": [
          {
            "value": "Assistance animals are always allowed",
            "name": "Pets allowed"
          },
          {
            "value": "Allow stay for 28 days or more",
            "name": "Long-term stays allowed"
          },
          {
            "value": "SYSTEM_KEY",
            "name": "Self check-in"
          },
          {
            "value": "SYSTEM_LOCK_ON_DOOR",
            "name": "Smart lock"
          },
          {
            "value": "SYSTEM_CLEAN",
            "name": "Housekeeping - available at extra cost"
          }
        ],
        "group_name": "Services"
      },
      {
        "items": [
          {
            "value": "SYSTEM_NO_AIR_CONDITIONING",
            "name": "Air conditioning"
          },
          {
            "value": "SYSTEM_NO_PRIVATE_ENTRANCE",
            "name": "Private entrance"
          }
        ],
        "group_name": "Not included"
      }
    ],
    "url": "https://www.airbnb.ca/rooms/1300059188064308611",
    "listing_title": "Stylish Downtown Getaway | Parking & GYM!",
    "property_id": "1300059188064308611",
    "listing_name": "Entire rental unit in Calgary, Canada",
    "location_details": [
      {
        "title": "Neighbourhood highlights",
        "value": "This condo is located in the heart of Calgary's Beltline and only a few blocks away from the city's best restaurants, shops, and attractions!"
      },
      {
        "title": "Getting around",
        "value": "You will have access to your own parking stall in the buildings secure parkade. The unit is located very centrally and a quick commute to anywhere you have to go!"
      }
    ],
    "description_by_sections": [
      {
        "title": null,
        "value": "Welcome to our 2-bed home in the heart of the Beltline! The dining area comfortably seats 6, perfect for gatherings. The primary bedroom features a super comfy King bed, while the secondary offers a cozy Queen. Need more space? A queen pull-out couch adds flexibility.Enjoy in-suite laundry and a fully stocked kitchen. Building amenities include a Gym and a Rooftop Patio with downtown views. Just 3 blocks off 17th Ave, this unit offers unbeatable walkability to shops, dining, and entertainment!"
      },
      {
        "title": "The space",
        "value": "Discover ultimate comfort and style in this beautifully designed 2-bedroom condo, offering everything you need for a relaxing stay:Bright & Open:-Sunlit south-facing balcony to enjoy natural light-Spacious dining table for 6, plus extra seating at the kitchen islandWork-Friendly:-Dedicated workspace with high-speed internet, printer, monitor, keyboard, and mouseCozy Bedrooms:-Primary room with a SUPER COMFY king-sized bed and generous closet space-Secondary room with a comfortable queen bed-Queen-sized pull-out couch for additional guestsWell-Equipped Bathroom:-Soft face, hand, and bath towels-Stocked with shampoo, conditioner, and body washFully Loaded Kitchen:-Features a blender, coffee maker, toaster, hot water kettle, and baking tools-Keurig machine with complimentary coffee pods for your morningsAdded Convenience:-58\" Smart TV-In Unit laundry room Building Amenities:-On-site fitness room-Stunning rooftop patio with panoramic city viewsUnbeatable Location:-Steps from Calgary’s best restaurants, shops, and downtown attractions-Ideal for those seeking a vibrant, walkable lifestyleWith its modern design, thoughtful amenities, and prime location, this condo is the perfect place to call home during your stay!"
      },
      {
        "title": "Guest access",
        "value": "You will have access to the entire Condo during your stay."
      },
      {
        "title": "Other things to note",
        "value": "-Missing keys incur a $250 replacement fee.-Respect condo bylaws, especially quiet hours after 10pm. We use a noise monitoring device; It does NOT record actual sounds or conversations, it simply monitors the noise level (measured in decibels). Minut is 100% privacy compliant and is required on this property. If you have any questions, please ask! :)"
      },
      {
        "title": "Registration details",
        "value": "BL287930"
      }
    ],
    "is_supperhost": true,
    "host_number_of_reviews": 1917,
    "host_rating": 4.89,
    "hosts_year": 3,
    "host_response_rate": 99,
    "is_guest_favorite": false,
    "travel_details": {
      "check_in": null,
      "check_out": null,
      "num_of_adults": null,
      "num_of_children": null,
      "num_of_infants": null,
      "num_of_pets": null
    },
    "pricing_details": {
      "num_of_nights": 3,
      "initial_price_per_night": 153.08,
      "price_per_night": 153.08,
      "price_without_fees": 459.24,
      "special_offer": null,
      "cleaning_fee": null,
      "airbnb_service_fee": null,
      "taxes": null
    },
    "total_price": 500.57,
    "currency": "USD",
    "cancellation_policy": [
      {
        "cancellation_name": "Full refund",
        "cancellation_value": "12/06/2025"
      },
      {
        "cancellation_name": "Partial refund",
        "cancellation_value": "12/13/2025"
      },
      {
        "cancellation_name": "No refund",
        "cancellation_value": "12/13/2025"
      }
    ],
    "property_number_of_reviews": 51,
    "host_details": {
      "name": "Tristan",
      "host_id": "52251080",
      "url": "https://www.airbnb.com/users/show/52251080",
      "image": "https://a0.muscache.com/im/pictures/user/1c9bf2f8-4deb-4723-b0c7-d6be080dbd49.jpg",
      "reviews": 1917,
      "rating": 4.89,
      "years_hosting": 3,
      "response_rate": "Response rate: 99%",
      "response_time": "Responds within an hour",
      "my_work": "Real Estate Agent",
      "languages": null
    },
    "reviews_details": [
      {
        "review_date": "2025-09-29T21:07:33Z",
        "rating": 5,
        "guest_name": "Kevin",
        "stayed_for": "Stayed a few nights",
        "guest_time_on_airbnb": "Medicine Hat, Canada",
        "review": "Nice place in a great area. Parking was excellent as spot is 20 steps from your door. Beds were quite comfortable and kitchen was stocked with everything you need. The area is pretty noisy at night but being downtown it should be expected. We really enjoyed our stay and would definitely stay again. Thank you Tristan",
        "host_response": null
      },
      {
        "review_date": "2025-08-17T20:30:20Z",
        "rating": 5,
        "guest_name": "Katie",
        "stayed_for": null,
        "guest_time_on_airbnb": "North Vancouver, Canada",
        "review": "The location was perfect for our stay. We attended a festival at Cowboy Park which was approximately a 15 min walk from this place. There is a lot of places to eat close by and within walking distance. The parking spot and street parking are both convenient and felt safe. The instructions into the building were a little confusing but we managed. Overall, we would definitely stay again and would recommend the space.",
        "host_response": null
      },
      {
        "review_date": "2025-10-05T21:07:10Z",
        "rating": 5,
        "guest_name": "Shawn",
        "stayed_for": "Stayed with kids",
        "guest_time_on_airbnb": "Lethbridge, Canada",
        "review": "Tristan’s place is fantastic! Great furnishings and comfortable beds. The location is close to wonderful restaurants and coffeehouses. It is close to lots of things to do yet tucked in a quiet street. The parking stall was very appreciated. Thanks Tristan!",
        "host_response": null
      },
      {
        "review_date": "2025-09-17T20:53:29Z",
        "rating": 5,
        "guest_name": "Alannah",
        "stayed_for": "Stayed a few nights",
        "guest_time_on_airbnb": "1 month on Airbnb",
        "review": "Great value for money, the apartment was beautiful and had everything you need. Tristan was very responsive and helpful, I’d definitely stay again if I came back to Calgary",
        "host_response": null
      },
      {
        "review_date": "2025-08-19T22:01:23Z",
        "rating": 5,
        "guest_name": "Ahmad",
        "stayed_for": "Stayed with kids",
        "guest_time_on_airbnb": "Edmonton, Canada",
        "review": "Our stay was wonderful, it’s a nice fancy safe place by the heart of downtown, only 5 minutes from Calgary tower and 5 to 6 minutes away from two downtown mosques in Calgary.",
        "host_response": null
      },
      {
        "review_date": "2025-07-23T19:02:22Z",
        "rating": 5,
        "guest_name": "Analiza",
        "stayed_for": null,
        "guest_time_on_airbnb": "4 years on Airbnb",
        "review": "We had a wonderful stay at Tristan’s place in Calgary! The house was clean, secure, and beautifully maintained. It looked just like the photos, if not better. Tristan was an excellent host, very welcoming and quick to respond to our messages. We truly felt comfortable and well taken care of throughout our stay.<br/>Will definitely recommend this place to all our friends and family in Saskatoon!",
        "host_response": null
      },
      {
        "review_date": "2025-07-18T19:12:44Z",
        "rating": 4,
        "guest_name": "Zoya",
        "stayed_for": "Stayed a few nights",
        "guest_time_on_airbnb": "Phoenix, Arizona",
        "review": "Pros:Great location! Beds were comfy. very little required from us to check out which was appreciated. <br/>Con:Pictures did not meet the actual place (small apartment) The work space is in the living room right next to the only TV, Sofa and access to the balcony. So if one of you is working the other person will have to be in one of the bedrooms.",
        "host_response": "Hi Zoya,<br/>In our listing photos, pictures show quite clearly that the desk is in the living room so I am sorry this was unexpected to you. We like to include a workspace where we can, and that was the space that worked. Our photos depict the space pretty accurately."
      },
      {
        "review_date": "2025-06-29T21:04:48Z",
        "rating": 4,
        "guest_name": "Reyes",
        "stayed_for": "Stayed a few nights",
        "guest_time_on_airbnb": "7 years on Airbnb",
        "review": "Very good spot, very centric.  It has been a good experience. The flat is comfortable and nice. Recommendable.<br/>Unfortunately, there was a fire alarm inspection during our stay. We couldn’t access to the rooftop.<br/>The price is a bit high comparing to other places, but it is true that is in Calgary Downtown and during the summer.",
        "host_response": null
      },
      {
        "review_date": "2025-06-18T19:14:00Z",
        "rating": 5,
        "guest_name": "Jared",
        "stayed_for": "Stayed a few nights",
        "guest_time_on_airbnb": "Meridian, Idaho",
        "review": "This place was amazing and the hosts had the two most important qualities I like to see: responsive and friendly. From the property you can get anywhere downtown in about 10 mins driving and there are a ton of things within a 5 to 10 min walk. It is in a safe neighborhood and while we were there it was quiet and peaceful. If you are looking for an affordable clean place to stay with responsive hosts then I recomend!",
        "host_response": null
      },
      {
        "review_date": "2025-08-04T20:25:20Z",
        "rating": 4,
        "guest_name": "Leah",
        "stayed_for": null,
        "guest_time_on_airbnb": "Toronto, Canada",
        "review": "Host was very communicative and responsive. Location is awesome and the place was accurately represented in the photos. <br/>**IMPORTANT** This building is VERY strict on noise. We were threatened by a resident at 3 pm in the afternoon because we were playing music and we talked in halls. We felt like we were walking on eggshells for the remainder of our stay. This place is suitable as a landing spot for a quiet group, but I would not recommend if you’re looking for a place that feels like home.",
        "host_response": "Hi Leah, I apologize you were affected by one neighbours actions. These do not reflect the building as a whole, and definitely not us as hosts either. We have normal building quiet hours, but it’s unfortunate the one encounter garnered a negative review here."
      },
      {
        "review_date": "2025-06-21T21:39:37Z",
        "rating": 4,
        "guest_name": "Julien",
        "stayed_for": null,
        "guest_time_on_airbnb": "Ottawa, Canada",
        "review": "Had some issues with the check in process due to a miscommunication on the host's part, but apart from that rough start, it was overall a great place (clean, quiet, good location).",
        "host_response": null
      },
      {
        "review_date": "2025-05-29T19:25:16Z",
        "rating": 5,
        "guest_name": "Brad",
        "stayed_for": "Stayed with a pet",
        "guest_time_on_airbnb": "Portland, Oregon",
        "review": "Really loved the location!  Very convenient to 17th Avenue with tons of restaurant options and shopping.  In the other direction, it was a short walk to the Central Library and the incredible murals all over Calgary!",
        "host_response": null
      },
      {
        "review_date": "2025-09-15T20:37:16Z",
        "rating": 5,
        "guest_name": "Sagiri",
        "stayed_for": null,
        "guest_time_on_airbnb": "Niagara Falls, Canada",
        "review": "Tristan was friendly and communicative our whole stay - always reaching out to make sure everything was going okay. :) Great host!",
        "host_response": null
      },
      {
        "review_date": "2025-09-07T19:16:31Z",
        "rating": 5,
        "guest_name": "Erkut",
        "stayed_for": "Stayed about a week",
        "guest_time_on_airbnb": "Lincolnshire, Illinois",
        "review": "Great stay, proactive and responsive hosts, everything is exactly same as listed, thanks for hosting us.",
        "host_response": null
      },
      {
        "review_date": "2025-04-28T21:43:23Z",
        "rating": 5,
        "guest_name": "Alison",
        "stayed_for": "Stayed one night",
        "guest_time_on_airbnb": "7 years on Airbnb",
        "review": "I found Tristan’s place an absolute diamond of a find! It was so secure and private, in a great location walkable to the bustling streets for restaurants and shops. The apartment was pristine and beautifully furnished, the kitchen was kitted out and very well stocked. The owners were so helpful and kind also. Such good value for money and will definitely stay again when I’m back in Calgary. Couldn’t recommend more highly! :)",
        "host_response": null
      },
      {
        "review_date": "2025-10-30T19:59:03Z",
        "rating": 5,
        "guest_name": "Jason",
        "stayed_for": "Stayed one night",
        "guest_time_on_airbnb": "Edmonton, Canada",
        "review": "Second time staying here. Great location and awesome host. Highly recommended and definitely stay here next time!",
        "host_response": null
      },
      {
        "review_date": "2025-07-11T20:21:21Z",
        "rating": 4,
        "guest_name": "Mary",
        "stayed_for": null,
        "guest_time_on_airbnb": "Warrenton, Virginia",
        "review": "The lodging matched the photos and description. We liked the apartment and the location. The price was very reasonable. We had 5 ppl stay comfortably. My reasons for not giving 5 stars is the fairly unreasonable quiet hours and the manner we were treated by other residents. And the serious amount of door locks and security was at times frustrating. It was hard to get in and out with all the keys fobs locks buttons and doors. If you intend to have a very quiet stay and few occupants this prob would be a great choice. If you wanna hang here and enjoy a few laughs in the middle of the day be prepared for noise disturbance complaints both from residents and an in house monitor system. The host was great and very good communicator. I just would not bring a group here. Beds were ok, but not great. Bathroom and kitchen very nice. Great location in Calgary. Cute place.  I’m sad we never went to the rooftop. We used the parking garage spot which was very convenient.",
        "host_response": "Thank you for your thoughtful review and for choosing to stay with us! We’re so glad to hear you enjoyed the apartment, appreciated the location, and found the parking convenient. It’s great to know the space comfortably accommodated your group and that communication was smooth throughout your stay.<br/>We did want to kindly clarify a few points for future guests:<br/>- The noise monitoring system is designed to only alert us of prolonged elevated noise levels, not brief or typical sounds of enjoyment.<br/>- Quiet hours begin at 9 PM on weekdays, which is just one hour earlier than Calgary’s bylaw, and are in place to maintain a respectful environment for all residents.<br/>- We’ve also recently streamlined our check-in process, reducing the number of steps and making it easier to navigate the building.<br/>We appreciate your feedback and are always looking for ways to improve. Thanks again for staying with us and for your honest insights!"
      },
      {
        "review_date": "2025-07-03T21:11:15Z",
        "rating": 5,
        "guest_name": "Nancy",
        "stayed_for": "Stayed with kids",
        "guest_time_on_airbnb": "Regina, Canada",
        "review": "Great place to stay in downtown Calgary. Great neighbourhood, close to shops. Highly recommended.",
        "host_response": null
      },
      {
        "review_date": "2025-07-01T19:27:00Z",
        "rating": 5,
        "guest_name": "Angie",
        "stayed_for": "Stayed with kids",
        "guest_time_on_airbnb": "Canada",
        "review": "Great experience! Highly recommend. Beautiful apartment and host was extremely helpful. Wish we stayed longer!",
        "host_response": null
      },
      {
        "review_date": "2025-06-13T22:05:40Z",
        "rating": 5,
        "guest_name": "Jessica",
        "stayed_for": "Stayed a few nights",
        "guest_time_on_airbnb": "Edmonton, Canada",
        "review": "We booked  staff members in Tristan’s place and they had a wonderful experience.  Very happy with their accommodations and how well Tristan communicated.",
        "host_response": null
      },
      {
        "review_date": "2025-03-02T22:03:08Z",
        "rating": 5,
        "guest_name": "Kevin",
        "stayed_for": "Stayed a few nights",
        "guest_time_on_airbnb": "Toronto, Canada",
        "review": "Excellent place to stay in Calgary. Very peaceful area, yet walkable to a ton of places in the area. The apartment was exactly as described, and the parking was great for a Full size F150 truck. The unit matched the pictures and descriptions, and the hosts were excellent.",
        "host_response": null
      },
      {
        "review_date": "2024-12-21T20:46:38Z",
        "rating": 5,
        "guest_name": "Yasmina",
        "stayed_for": "Stayed over a week",
        "guest_time_on_airbnb": "Sherwood Park, Canada",
        "review": "nice quiet location. Walking distance to everything I needed - safeway is just around the corner.<br/>I stayed 2 weeks and it was homey.<br/>I loved it so much I am coming back for work for 3 week and booked it again.<br/>Kenzie was a gem to deal with.",
        "host_response": null
      },
      {
        "review_date": "2025-09-21T20:30:35Z",
        "rating": 5,
        "guest_name": "Devon",
        "stayed_for": "Stayed a few nights",
        "guest_time_on_airbnb": "Kaslo, Canada",
        "review": "Clean , convenient and good fare pricing",
        "host_response": null
      },
      {
        "review_date": "2025-09-19T22:17:11Z",
        "rating": 5,
        "guest_name": "Justin",
        "stayed_for": "Stayed one night",
        "guest_time_on_airbnb": "Montreal, Canada",
        "review": "Very clean and well located place to stay in Calgary.",
        "host_response": null
      }
    ],
    "timestamp": "2025-11-10T23:33:18.850Z"
  }
]